scripts/stress-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 50       # 50 usuarios por segundo
    - duration: 30
      arrivalRate: 100      # Pico de carga
  payload:
    path: "users.csv"
    fields:
      - email
      - password
scenarios:
  - name: Estrés extremo sobre creación de reservas
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: token

      - post:
          url: "/reservations"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            date: "2030-01-01"
            time: "13:00"